# LEETCODE
# Problem-181. Employees Earning More Than Their Managers

## Info
Class: Easy

Source: https://leetcode.com/problems/employees-earning-more-than-their-managers/

## Description
Table: Employee
| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |

id is the primary key column for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.

## To Do
Write an SQL query to find the employees who earn more than their managers.

Return the result table in any order.

The query result format is in the following example.

 

Example 1:

Input: 
Employee table:
| id | name  | salary | managerId |
|----|-------|--------|-----------|
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |

Output: 
| Employee |
|----------|
| Joe      |

Explanation: Joe is the only employee who earns more than his manager.

## Importing

In [1]:
import pandas as pd

## Define Schema

In [2]:
data = {
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 80000, 60000, 90000],
    'managerId': [3, 4, None, None]
}

df = pd.DataFrame(data)

In [3]:
df

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

## Task

In [28]:
# Define functions
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    
    # Merging two dataframes
    emp = employee.merge(employee[['id', 'salary']], how='left', left_on='managerId', right_on='id', suffixes=('', '_m'))

    # Filter employees who has higher salary than their manager
    emp_name = emp.loc[emp.salary > emp.salary_m, 'name']
    
    return pd.DataFrame({'Employee':emp_name})

In [29]:
find_employees(df)

  Employee
0      Joe